// =============================================================================
// УРОК 18 — BasicAtoi
// НОВОЕ: сбор числа из строки — result*10 + digit
// =============================================================================

package piscine

func BasicAtoi(s string) int {
	o_number := 0
	c := 0
	a_s := []rune(s)

	for _, word := range a_s {
		for i := '0'; i < word; i++ {
			c++
		}
		o_number = o_number*10 + c // сдвиг разряда + новая цифра: "12" → 1*10+2
		c = 0
	}
	return o_number
}

// "123" → (((0*10+1)*10+2)*10+3) = 123
